Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralSectionHasIncompleteDefinition Property
 Structural Section has incomplete definition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralSectionHasIncompleteDefinition { get; }
Public Shared ReadOnly Property StructuralSectionHasIncompleteDefinition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralSectionHasIncompleteDefinition {
	FailureDefinitionId^ get ();
}
static member StructuralSectionHasIncompleteDefinition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace